# Python Data Visualizations

   - I will first create my own sample data to check if the packages are working properly then the fun with real data begins!

In [18]:
import pandas as pd
import numpy as np

In [19]:
# I will take the courses I am currently taking at my university as a sample data
course_details=np.array([["SECT-M5201", "Advanced Development","SECT-4221","Enterprise Application Developement",7.00],
                ["SECT-M4451", "Machine Learning and big data","SECT-4451","Machine Learning and big data",5.00],
                ["SECT-M4181", "System Modeling","SECT-4181","Requirement Engineering and architectire",7.00],
                ["SECT-M4141", "High performance computing","SECT-4141","Fundamentals of distributed systems",7.00],
                ["SECT-M4231", "Software project management","SECT-4231","Software Project Management",5.00]])

column_lables= ["Module Code", "Module Name", "Course Code", "Course Title", "ECTS"]

In [20]:
course_table = pd.DataFrame(data= course_details, columns=column_lables)

In [21]:
course_table

,Module Code,Module Name,Course Code,Course Title,ECTS
0,SECT-M5201,Advanced Development,SECT-4221,Enterprise Application Developement,7.0
1,SECT-M4451,Machine Learning and big data,SECT-4451,Machine Learning and big data,5.0
2,SECT-M4181,System Modeling,SECT-4181,Requirement Engineering and architectire,7.0
3,SECT-M4141,High performance computing,SECT-4141,Fundamentals of distributed systems,7.0
4,SECT-M4231,Software project management,SECT-4231,Software Project Management,5.0

- Loading a .csv dataset

In [22]:
car_financing_dataset= "../data/car_financing.csv"
car_financing_dataframe= pd.read_csv(car_financing_dataset)

In [23]:
car_financing_dataframe

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna
...,...,...,...,...,...,...,...,...,...
403,56,3951.11,796.01,9.54,786.47,3164.64,60,0.0290,VW Golf R
404,57,3164.64,796.01,7.64,788.37,2376.27,60,0.0290,VW Golf R
405,58,2376.27,796.01,5.74,790.27,1586.00,60,0.0290,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60,0.0290,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60,0.0290,VW Golf R

- Loading a .xlsx dataset

In [24]:
car_financing_dataset= "../data/car_financing.xlsx"
car_financing_dataframe= pd.read_excel(car_financing_dataset)

In [25]:
car_financing_dataframe

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna
...,...,...,...,...,...,...,...,...,...
403,56,3951.11,796.01,9.54,786.47,3164.64,60,0.0290,VW Golf R
404,57,3164.64,796.01,7.64,788.37,2376.27,60,0.0290,VW Golf R
405,58,2376.27,796.01,5.74,790.27,1586.00,60,0.0290,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60,0.0290,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60,0.0290,VW Golf R

- Let's check the datatypes for each columns in the given dataset

In [26]:
car_financing_dataframe.dtypes

Month                 int64
Starting Balance    float64
Repayment           float64
Interest Paid       float64
Principal Paid      float64
New Balance         float64
term                  int64
interest_rate       float64
car_type             object
dtype: object

In [27]:
#checking the first 5 rows
car_financing_dataframe.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [28]:
# checking the last 5 rows
car_financing_dataframe.tail()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
403,56,3951.11,796.01,9.54,786.47,3164.64,60,0.029,VW Golf R
404,57,3164.64,796.01,7.64,788.37,2376.27,60,0.029,VW Golf R
405,58,2376.27,796.01,5.74,790.27,1586.00,60,0.029,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60,0.029,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60,0.029,VW Golf R

In [30]:
#checking the number of rows an columns
car_financing_dataframe.shape

(408, 9)

# Slicing the dataset

In [31]:
#Let's isolate the car type and the starting balance into a separate dataframe
ct_sb= car_financing_dataframe[["car_type","Starting Balance"]]

NameError: name 'car_financing_dataframe' is not defined

In [33]:
ct_sb.head()

        car_type  Starting Balance
0  Toyota Sienna          34689.96
1  Toyota Sienna          34205.66
2  Toyota Sienna          33718.53
3  Toyota Sienna          33228.55
4  Toyota Sienna          32735.70

NameError: name 'car_financing_dataframe' is not defined